run/pilot300Wv2/pilot300Wv2/0.orig/U.solids
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U.solids;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            JohnsonJacksonParticleSlip;
        specularityCoefficient specularityCoefficient [0 0 0 0 0 0 0] 0.01;
        value           uniform (0 0 0);
    }
    "inlet.*"
    {
        $wall
    }
    "outlet.*"
    {
        $wall
    }
    
}


// ************************************************************************* //
