run/pilot300Wv2/pilot300Wv2/0.orig/alpha.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      alpha.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    "inlet_.*"
    {
        type            fixedValue;
        value           uniform 1;
    }
    "outlet.*"
    {
        type            fixedValue;
        value           uniform 1;
    }    
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
