run/pilot300Wv2/pilot300Wv2/0.orig/alphat.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      alphat.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "inlet_.*"
    {
        type            fixedValue;
        value           uniform 0;
    }
    "outlet.*"
    {
        type            fixedValue;
        value           uniform 0;
    }
    wall
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}


// ************************************************************************* //
