run/pilot300Wv2/pilot300Wv2/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#ifeq $simulationType leakage // Removing inlet_DC2
    patches
    (
        {
            name    inlet_SL;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     inlet_SL;
        }
        {
            name    outlet_AR;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     outlet_AR;
        }
        {
            name    outlet_FR;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     outlet_FR;
        }
    );
#else
    patches
    (
        {
            name    inlet_SL;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     inlet_SL;
        }
        {
            name    outlet_AR;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     outlet_AR;
        }
        {
            name    outlet_FR;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     outlet_FR;
        }
        {
            name    inlet_DC2;
            patchInfo
            {
                type    patch;
            }
            constructFrom set;
            set     inlet_DC2;
        }
    );
#endif



// ************************************************************************* //
