run/pilot300Wv2/pilot300Wv2/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type       limitPressure;

    min        1e4;
}
limittgas
{
    type        limitTemperature;
     active          yes;
    selectionMode   all;
    min             200;
    max             2000;
    phase           gas; 
}

limittsolid
{
    type        limitTemperature;
     active          yes;
    selectionMode   all;
    min             200;
    max             2000;
    phase           solids; 
}


// ************************************************************************* //
