run/pilot300Wv2/pilot300Wv2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    
    "alpha.*"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
		
        nAlphaCorr      1;
        nAlphaSubCycles 8;
        implicitPhasePressure on;
		
        dgdtLimit       1e-6;
        
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }
    
    

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-10;
        relTol          0.01;
        minIter         1;
        maxIter         50;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-11;		
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-07;
        relTol          0;
        minIter         1;
    }

    "(h|e).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    "Theta.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "d.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "(k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "Yi.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        residualAlpha   1e-6;
        tolerance       1e-07;
        relTol          0;
        minIter         1;
    }

    "Ii.*|G.*"
    {
        solver                GAMG;
        smoother              symGaussSeidel;
        processorAgglomerator procFaces;
        nAgglomeratingCells   400;

        tolerance             1e-10;
        relTol                0.;
        minIter               1;
        maxIter               5;
    }

    yPsi
    {
        solver              GAMG;
        smoother            symGaussSeidel;

        tolerance           1e-12;
        relTol              0;
        maxIter             10;
    }
}

PIMPLE
{
    nOuterCorrectors         5;    // Amount of outer corrections
    nCorrectors              1;    // Amount of inner corrections
    nNonOrthogonalCorrectors 1;    // Amount of non-orthogonal corrections
    nEnergyCorrectors        1;    // Amount of energy equation solves


    faceMomentum off; // 
}

relaxationFactors
{
    equations
    {
        ".*"                 1.0;
    }
}


// ************************************************************************* //
