run/pilot300Wv2/pilot300Wv2/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "all.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle   170;

// Do not mark region edges
geometricTestOnly       yes;

subsetFeatures
{
    // Include only edges that intersect the plane
    // plane
    // {
    //     planeType       pointAndNormal;
    //     point           (0 0 0);
    //     normal          (1 0 0);
    // }

    // Include only edges inside the box
    // insideBox           (0 0 0)(1 1 1);

    // Include only edges outside the box
    // outsideBox          (0 0 0)(1 1 1);

    // Include nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges    yes;

    // Include open edges (edges with 1 connected face)
    openEdges           yes;
}


trimFeatures
{
    // Remove features with fewer than the specified number of edges
    minElem         0;

    // Remove features shorter than the specified cumulative length
    minLen          0.0;
}

// Write features to obj format for postprocessing
writeObj                yes;
verboseObj              no;

// ************************************************************************* //
