run/pilot300Wv2/pilot300Wv2/system/surfaceSumSpecieFluxesFaceZoneFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates (weighted) sum over a faceZone for all species

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/surfaceFieldValue/faceZoneFlowRate"

#include "$FOAM_CASE/system/functionObject.cfg"

// Mistake! Oriented sum cannot be applied to these fields!

weightField     alphaRhoPhi.gas;

fields          ( // all species
  surfaceInterpolate(O2.gas)
  surfaceInterpolate(CO.gas)
  surfaceInterpolate(CO2.gas)
  surfaceInterpolate(H2O.gas)
  surfaceInterpolate(H2.gas)
  surfaceInterpolate(CH4.gas)
  surfaceInterpolate(N2.gas)
  surfaceInterpolate(Ar.gas)
);

// ************************************************************************* //
