run/pilot300Wv2/pilot300Wv2/system/surfaceSumSpecieFluxesPatchFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates (weighted) sum over a patch for all species

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patchFlowRate"

#include "$FOAM_CASE/system/functionObject.cfg"

// Mistake! Oriented sum cannot be applied to these fields!

weightField     alphaRhoPhi.gas;

fields          ( // all species
    O2.gas
    CO.gas
    CO2.gas
    H2O.gas
    H2.gas
    CH4.gas
    N2.gas
    Ar.gas
);

// ************************************************************************* //
