run/pilot300Wv2/pilot300Wv2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

configControlVolume {
    includeCut false;
    useSurfaceOrientation true;
    includeInside   true;
    includeOutside  false;
    nearDistance    2e-5;
    curvature       -1.;
}

actions
(
    // Slot
    {
        action  new;
        type    faceSet;
        name    inlet_SL;
        source  boxToFace;
        box     (-0.006 -0.0096 0.00001) 
                ( 0.003 -0.0090 0.02499);
    }
    {
        name inlet_SL;
        type faceSet;
        action subset;
        source boundaryToFace;
        sourceInfo
        {
        }
    }

    // Outlets
    {
        action  new;
        type    faceSet;
        name    outlet_AR;
        source  boxToFace;
        box     (-0.050 0.4395 0.000) 
                (-0.001 0.442 0.025);
    }
    {
        name outlet_AR;
        type faceSet;
        action subset;
        source boundaryToFace;
        sourceInfo
        {
        }
    }
    {
        action  new;
        type    faceSet;
        name    outlet_FR;
        source  boxToFace;
        box     (-0.001 0.4395 0.000) 
                ( 0.030 0.442 0.025);
    }
    {
        name outlet_FR;
        type faceSet;
        action subset;
        source boundaryToFace;
        sourceInfo
        {
        }
    }

    // Fluidization sources
    {
        action  new;
        type    cellSet;
        name    inlet_DC;
        source  cylinderToCell;
        point1  (-0.0065 0.05 0.025);
        point2  (-0.0065 0.05 0);
        radius  0.0035;
    }
    {
        action  new;
        type    faceSet;
        name    inlet_DC2;
        source  cylinderToFace;
        point1  (-0.01 0.1 0.024);
        point2  (-0.01 0.1 0.026);
        radius  0.0025;
    }
    {
        name inlet_DC2;
        type faceSet;
        action subset;
        source boundaryToFace;
        sourceInfo
        {
        }
    }

    // Solids loading
    {
        action  new;
        type    cellZoneSet;
        name    solids_loading;
        source  boxToCell;
        box     (-0.1 -0.1 -0.1) 
                ( 0.1  0.2  0.1);
    }

    // Control surfaces
    {
        action  new;
        type    faceSet;
        name    controlSurface_SL_AR;
        source  boxToFace;
        box     (-0.00751  0.00105 -0.00001) 
                (-0.00149  0.00115  0.02501);
    }
    {
        name    controlSurface_SL_AR;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        faceSet controlSurface_SL_AR;
        normal  (0 1 0);
    }
    {
        action  new;
        type    faceSet;
        name    controlSurface_SL_FR;
        source  boxToFace;
        box     (-0.00001  0.00105 -0.00001) 
                ( 0.00451  0.00115  0.02501);
    }
    {
        name    controlSurface_SL_FR;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        faceSet controlSurface_SL_FR;
        normal  (0 1 0);
    }
    {
        action  new;
        type    faceSet;
        name    controlSurface_DC_AR;
        source  boxToFace; // triSurface
        box     (-0.019  0.1842 0.012) 
                (-0.001  0.1851 0.0251);
    }
    {
        name    controlSurface_DC_AR;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        faceSet controlSurface_DC_AR;
        normal  (0 1 0);
    }
    {
        action  new;
        type    faceSet;
        name    controlSurface_DC_FR;
        source  boxToFace;
        box     (-0.00018 0.11999 -0.00001) 
                ( 0.00031 0.18501  0.01126);
    }
    {
        name    controlSurface_DC_FR;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        faceSet controlSurface_DC_FR;
        normal  (1 0 0);
    }

    // Control volumes
    {
        name    controlVolume_SL;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/controlVolume_SL.stl";
            outsidePoints ((0.02 0.4 0.01));
            $configControlVolume
        }
    }
    {
        name    controlVolume_DC;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/controlVolume_DC.stl";
            outsidePoints ((0.02 0.4 0.01));
            $configControlVolume
        }
    }
    {
        name    controlVolume_AR;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/controlVolume_AR.stl";
            outsidePoints ((0.02 0.4 0.01));
            $configControlVolume
        }
    }
    {
        name    controlVolume_FR;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/controlVolume_FR.stl";
            outsidePoints ((-0.02 0.4 0.01));
            $configControlVolume
        }
    }
);

// ************************************************************************* //
