run/pilot300Wv2/pilot300Wv2/system/volIntegrateSolidSpeciesFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/volFieldValue/volIntegrate.cfg"

#include "$FOAM_CASE/system/functionObject.cfg"

weightFields (alpha.solids rho.solids);

fields          ( // all species
    Fe2O3.solids
    FeO.solids
    inerts.solids
);

// ************************************************************************* //